zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_rcc.c
  * @author  MCD Application Team
  * @brief   RCC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Reset and Clock Control (RCC) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                      ##### RCC specific features #####
  ==============================================================================
    [..]
      After reset the device is running from HSI oscillator (64 MHz), D-Cache
      and I-Cache are disabled, and all peripherals are off except internal
      SRAM, and JTAG.

      (+) There is no prescaler on High speed (AHBs) and Low speed (APBs) busses:
          all peripherals mapped on these busses are running at HSI speed.
      (+) The clock for all peripherals is switched off, except the SRAM.
      (+) All GPIOs are in analog mode, except the JTAG pins which
          are assigned to be used for debug purpose.

    [..]
      Once the device started from reset, the user application has to:
      (+) Configure the clock source to be used to drive the System clock
          (if the application needs higher frequency/performance)
      (+) Configure the System clock frequency
      (+) Configure the AHB and APB busses prescalers
      (+) Enable the clock for the peripheral(s) to be used
      (+) Configure the clock source(s) for peripherals which clocks are not
          derived from the System clock

  @endverbatim
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @defgroup RCC RCC
  * @brief RCC HAL module driver
  * @{
  */

#ifdef HAL_RCC_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @defgroup RCC_Private_Macros RCC Private Macros
  * @{
  */
#define IS_RCC_OSCILLATORTYPE(__OSCILLATOR__) (((__OSCILLATOR__) == RCC_OSCILLATORTYPE_NONE)  || \
                                               (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_HSE)   == \
                                                RCC_OSCILLATORTYPE_HSE)                     || \
                                               (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_HSI)   == \
                                                RCC_OSCILLATORTYPE_HSI)                     || \
                                               (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_MSI)   == \
                                                RCC_OSCILLATORTYPE_MSI)                     || \
                                               (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_LSI)   == \
                                                RCC_OSCILLATORTYPE_LSI)                     || \
                                               (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_LSE)   == \
                                                RCC_OSCILLATORTYPE_LSE))

#define RCC_GET_MCO_GPIO_PIN(__RCC_MCOx__)    ((__RCC_MCOx__) & GPIO_PIN_MASK)
#define RCC_GET_MCO_GPIO_AF(__RCC_MCOx__)     (((__RCC_MCOx__) & RCC_MCO_GPIOAF_MASK) >> RCC_MCO_GPIOAF_POS)
#define RCC_GET_MCO_GPIO_INDEX(__RCC_MCOx__)  (((__RCC_MCOx__) & RCC_MCO_GPIOPORT_MASK) >> RCC_MCO_GPIOPORT_POS)

#if defined(GPIOJ) && defined(GPIOK)
#define RCC_GET_MCO_GPIO_PORT(__RCC_MCOx__)   ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  0U) ? GPIOA : \
                                               ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  1U) ? GPIOB : \
                                                ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  2U) ? GPIOC : \
                                                 ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  3U) ? GPIOD : \
                                                  ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  4U) ? GPIOE : \
                                                   ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  5U) ? GPIOF : \
                                                    ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  6U) ? GPIOG : \
                                                     ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  7U) ? GPIOH : \
                                                      ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  8U) ? GPIOI : \
                                                       ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  9U) ? GPIOJ : \
                                                        ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) == 10U) ? GPIOK : \
                                                         ((RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) == 11U) ? GPIOZ : \
                                                          NULL))))))))))))
#else
#define RCC_GET_MCO_GPIO_PORT(__RCC_MCOx__)   (RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  0U ? GPIOA :       \
                                               (RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  1U ? GPIOB :       \
                                                (RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  2U ? GPIOC :       \
                                                 (RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  3U ? GPIOD :       \
                                                  (RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  4U ? GPIOE :       \
                                                   (RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  5U ? GPIOF :       \
                                                    (RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  6U ? GPIOG :       \
                                                     (RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  7U ? GPIOH :       \
                                                      (RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  8U ? GPIOI :       \
                                                       (RCC_GET_MCO_GPIO_INDEX((__RCC_MCOx__)) ==  9U ? GPIOZ : NULL) \
                                                      )))))))))
#endif /* GPIOJ && GPIOK */

/**
  * @}
  */


