zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
/* Private define ------------------------------------------------------------*/
/** @defgroup RCC_Private_Constants RCC Private Constants
  * @{
  */
#define LSI_TIMEOUT_VALUE          2UL    /* 2 ms (minimum Tick + 1) */
#define LSE_TIMEOUT_VALUE          1000UL
#define PLL_TIMEOUT_VALUE          2UL    /* 2 ms (minimum Tick + 1) */
#define CLOCKSWITCH_TIMEOUT_VALUE  5000UL /* 5 s    */
#define FINDIV_TIMEOUT_VALUE       1UL
#define PREDIV_TIMEOUT_VALUE       1UL
#define LSMCUDIV_TIMEOUT_VALUE     1UL
#define APB1DIV_TIMEOUT_VALUE      1UL
#define APB2DIV_TIMEOUT_VALUE      1UL
#define APB3DIV_TIMEOUT_VALUE      1UL
#define APB4DIV_TIMEOUT_VALUE      1UL
#define APBDBGDIV_TIMEOUT_VALUE    1UL
/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
/** @defgroup RCC_Private_Functions RCC Private Functions
  * @{
  */

void HAL_RCC_HSIMON_IRQHandler(void);
__weak void HAL_RCC_CSSCallback(void);
/* Private functions ---------------------------------------------------------*/
/**
  * @brief  Returns the state of HSE clock (used or not).
  *
  * @note   The status is recomputed by reading back the settings
  *         in the SoC registers
  * @retval TRUE if HSE is used, False else
  */
static uint32_t RCC_is_hse_in_use(void)
{
  uint32_t gfg;
  uint32_t i;
  uint32_t status = 0;

  /* Check GFG */
  gfg = RCC->MUXSELCFGR;
#if defined(RCC_MUXSELCFGR_MUXSEL7)
  if ((((gfg & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL1_Msk) >> RCC_MUXSELCFGR_MUXSEL1_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL2_Msk) >> RCC_MUXSELCFGR_MUXSEL2_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL3_Msk) >> RCC_MUXSELCFGR_MUXSEL3_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL4_Msk) >> RCC_MUXSELCFGR_MUXSEL4_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL5_Msk) >> RCC_MUXSELCFGR_MUXSEL5_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL6_Msk) >> RCC_MUXSELCFGR_MUXSEL6_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL7_Msk) >> RCC_MUXSELCFGR_MUXSEL7_Pos) == 0x1U))
#else
  if ((((gfg & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL1_Msk) >> RCC_MUXSELCFGR_MUXSEL1_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL2_Msk) >> RCC_MUXSELCFGR_MUXSEL2_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL3_Msk) >> RCC_MUXSELCFGR_MUXSEL3_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL4_Msk) >> RCC_MUXSELCFGR_MUXSEL4_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL5_Msk) >> RCC_MUXSELCFGR_MUXSEL5_Pos) == 0x1U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL6_Msk) >> RCC_MUXSELCFGR_MUXSEL6_Pos) == 0x1U))
#endif /* RCC_MUXSELCFGR_MUXSEL7 */
  {
    return 1;
  }

  /* HSE is ON but no pll is client so check xbar */
  for (i = 0U; i < 64U; i++)
  {
    if ((RCC->XBARxCFGR[i] & RCC_XBARxCFGR_XBARxSEL_Msk) == RCC_XBARxCFGR_XBARxSEL_6)
    {
      status = 1;
      break;
    }
  }

  return status;
}

/**
  * @brief  Returns the state of HSI clock (used or not).
  *
  * @note   The status is recomputed by reading back the settings
  *         in the SoC registers
  * @retval TRUE if HSI is used, False else
  */
static uint32_t RCC_is_hsi_in_use(void)
{
  uint32_t gfg;
  uint32_t i;
  uint32_t status = 0;

  /* Check GFG */
  gfg = RCC->MUXSELCFGR;
#if defined(RCC_MUXSELCFGR_MUXSEL7)
  if ((((gfg & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL1_Msk) >> RCC_MUXSELCFGR_MUXSEL1_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL2_Msk) >> RCC_MUXSELCFGR_MUXSEL2_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL3_Msk) >> RCC_MUXSELCFGR_MUXSEL3_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL4_Msk) >> RCC_MUXSELCFGR_MUXSEL4_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL5_Msk) >> RCC_MUXSELCFGR_MUXSEL5_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL6_Msk) >> RCC_MUXSELCFGR_MUXSEL6_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL7_Msk) >> RCC_MUXSELCFGR_MUXSEL7_Pos) == 0x0U))
#else
  if ((((gfg & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL1_Msk) >> RCC_MUXSELCFGR_MUXSEL1_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL2_Msk) >> RCC_MUXSELCFGR_MUXSEL2_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL3_Msk) >> RCC_MUXSELCFGR_MUXSEL3_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL4_Msk) >> RCC_MUXSELCFGR_MUXSEL4_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL5_Msk) >> RCC_MUXSELCFGR_MUXSEL5_Pos) == 0x0U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL6_Msk) >> RCC_MUXSELCFGR_MUXSEL6_Pos) == 0x0U))
#endif /* RCC_MUXSELCFGR_MUXSEL7 */
  {
    return 1;
  }

  /* HSI is ON but no pll is client so check xbar */
  for (i = 0U; i < 64U; i++)
  {
    if ((RCC->XBARxCFGR[i] & RCC_XBARxCFGR_XBARxSEL_Msk) == RCC_XBARxCFGR_XBARxSEL_5)
    {
      status = 1;
      break;
    }
  }

  return status;
}

/**
  * @brief  Returns the state of MSI clock (used or not).
  *
  * @note   The status is recomputed by reading back the settings
  *         in the SoC registers
  * @retval TRUE if MSI is used, False else
  */
static uint32_t RCC_is_msi_in_use(void)
{
  uint32_t gfg;
  uint32_t i;
  uint32_t status = 0;

  /* Check GFG */
  gfg = RCC->MUXSELCFGR;
#if defined(RCC_MUXSELCFGR_MUXSEL7)
  if ((((gfg & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL1_Msk) >> RCC_MUXSELCFGR_MUXSEL1_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL2_Msk) >> RCC_MUXSELCFGR_MUXSEL2_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL3_Msk) >> RCC_MUXSELCFGR_MUXSEL3_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL4_Msk) >> RCC_MUXSELCFGR_MUXSEL4_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL5_Msk) >> RCC_MUXSELCFGR_MUXSEL5_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL6_Msk) >> RCC_MUXSELCFGR_MUXSEL6_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL7_Msk) >> RCC_MUXSELCFGR_MUXSEL7_Pos) == 0x2U))
#else
  if ((((gfg & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL1_Msk) >> RCC_MUXSELCFGR_MUXSEL1_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL2_Msk) >> RCC_MUXSELCFGR_MUXSEL2_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL3_Msk) >> RCC_MUXSELCFGR_MUXSEL3_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL4_Msk) >> RCC_MUXSELCFGR_MUXSEL4_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL5_Msk) >> RCC_MUXSELCFGR_MUXSEL5_Pos) == 0x2U) ||
      (((gfg & RCC_MUXSELCFGR_MUXSEL6_Msk) >> RCC_MUXSELCFGR_MUXSEL6_Pos) == 0x2U))
#endif /* RCC_MUXSELCFGR_MUXSEL7 */
  {
    return 1;
  }

  /* HSE is ON but no pll is client so check xbar */
  for (i = 0U; i < 64U; i++)
  {
    if ((RCC->XBARxCFGR[i] & RCC_XBARxCFGR_XBARxSEL_Msk) == RCC_XBARxCFGR_XBARxSEL_7)
    {
      status = 1;
      break;
    }
  }

