zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
  return status;
}

/**
  * @brief  Returns the state of LSI clock (used or not).
  *
  * @note   The status is recomputed by reading back the settings
  *         in the SoC registers
  * @retval TRUE if LSI is used, False else
  */
static uint32_t RCC_is_lsi_in_use(void)
{
  uint32_t i;
  uint32_t status = 0;

  /* check xbar */
  for (i = 0U; i < 64U; i++)
  {
    if ((RCC->XBARxCFGR[i] & RCC_XBARxCFGR_XBARxSEL_Msk) == RCC_XBARxCFGR_XBARxSEL_D)
    {
      status = 1;
      break;
    }
  }

  return status;
}

/**
  * @brief  Returns the state of LSE clock (used or not).
  *
  * @note   The status is recomputed by reading back the settings
  *         in the SoC registers
  * @retval TRUE if LSE is used, False else
  */
static uint32_t RCC_is_lse_in_use(void)
{
  uint32_t i;
  uint32_t status = 0;

  /* check xbar */
  for (i = 0U; i < 64U; i++)
  {
    if ((RCC->XBARxCFGR[i] & RCC_XBARxCFGR_XBARxSEL_Msk) == RCC_XBARxCFGR_XBARxSEL_E)
    {
      status = 1;
      break;
    }
  }

  return status;
}
/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/

/** @defgroup RCC_Exported_Functions RCC Exported Functions
  * @{
  */

/** @defgroup RCC_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
  @verbatim
 ===============================================================================
           ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]
      This section provides functions allowing to configure the internal and external oscillators
      (HSE, HSI, LSE, MSI, LSI, PLL, CSS and MCO) and the System busses clocks (SYSCLK, AHB, APB1
       APB2, APB3 and APB4).

    [..] Internal/external clock and PLL configuration
         (+) HSI (high-speed internal): 64 MHz factory-trimmed RC used directly or through
             the PLL as System clock source.

         (+) MSI (Multiple Speed Internal): Its frequency is software trimmable (4 or 16 MHz).

         (+) LSI (low-speed internal): 32 KHz low consumption RC used as IWDG and/or RTC
             clock source.

         (+) HSE (high-speed external): 4 to 48 MHz crystal oscillator used directly or
             through the PLL as System clock source. Can be used also optionally as RTC clock source.

         (+) LSE (low-speed external): 32.768 KHz oscillator used optionally as RTC clock source.

         (+) PLL2 (clocked by HSI, HSE or MSI). This PLL is outside of the RCC but control registers
             are located inside.

         (+) PLL3 (clocked by HSI, HSE or MSI). This PLL is outside of the RCC but control registers
             are located inside.

         (+) PLL4 (clocked by HSI, HSE or MSI).

         (+) PLL5 (clocked by HSI, HSE or MSI).

         (+) PLL6 (clocked by HSI, HSE or MSI).

         (+) PLL7 (clocked by HSI, HSE or MSI).

         (+) PLL8 (clocked by HSI, HSE or MSI).

         (+) CSS (Clock security system): once enabled, if a HSE clock failure occurs
            (HSE used directly or through PLL as System clock source), the System clock
             is automatically switched to HSI and an interrupt is generated if enabled.

         (+) LSECSS (LSE Clock security system), once enabled and if a LSE clock failure occurs
             (++) The clock provided to the RTC is disabled immediately by the hardware
             (++) A failure event is generated (rcc_lsecss_fail). This event is connected to the TAMP
                  block, allowing to wake up if in low power, and allowing the protection of backup
                  registers and BKPSRAM.

         (+) MCO1 (micro controller clock output), used to output either findiv61 or flexclk_clkobs0
             (through a configurable pre-scaler).

         (+) MCO2 (micro controller clock output), used to output either findiv62 or flexclk_clkobs1
             (through a configurable pre-scaler).

    [..] System, AHB and APB busses clocks configuration
         (+) Several clock sources can be used to drive the System clock (SYSCLK): MSI, HSI,
             HSE and main PLL.
             The AHB clock (HCLK) is derived from System clock through configurable
             prescaler and used to clock the CPU, memory and peripherals mapped
             on AHB bus (DMA, GPIO...). APB1 (PCLK1) and APB2 (PCLK2) clocks are derived
             from AHB clock through configurable prescalers and used to clock
             the peripherals mapped on these busses.

         (+) The clock source frequency should be adapted depending on the device voltage range
             as listed in the Reference Manual "Clock source frequency versus voltage scaling" chapter.

  @endverbatim

  * @{
  */

/**
  * @brief  Reset the RCC clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - HSI ON and used as system clock source
  *            - HSE, HSI, PLL2, PLL3, PLL4, PLL5, PLL6, PLL7, PLL8 OFF
  *            - AHB, APB1 and APB2 prescaler set to 1
  *            - CSS, MCO1 and MCO2 OFF
  *            - All interrupts disabled
  *            - All interrupt and reset flags cleared
  * @note   This function doesn't modify the configuration of:
  *            - Peripheral clocks
  *            - LSI, LSE and RTC clocks
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCC_DeInit(void)
{
  uint32_t tickstart;
  uint32_t i;

  /* Set HSION bit to enable HSI oscillator */
  SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSION);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait till HSI is ready */
  while ((RCC->OCRDYR & RCC_OCRDYR_HSIRDY) == 0U)
  {
    if ((HAL_GetTick() - tickstart) > HSI_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Reset MCO1 Configuration Register */
  CLEAR_REG(RCC->MCO1CFGR);

  /* Reset MCO2 Configuration Register */
  CLEAR_REG(RCC->MCO2CFGR);

  /* Reset xbar channels inputs */
  /* Reset FINDIVx, PREDIVx */
  for (i = 0U; i < 64U; i++)
  {
    RCC->XBARxCFGR[i] = RCC_XBAR_CLKSRC_HSI | (1U << 6);
    WRITE_REG(RCC->FINDIVxCFGR[i], 0x00000040U | (1U << 6));
    CLEAR_REG(RCC->PREDIVxCFGR[i]);
  }

  /* Reset PLLs */
  CLEAR_REG(RCC->PLL4CFGR4);
  CLEAR_REG(RCC->PLL5CFGR4);
  CLEAR_REG(RCC->PLL6CFGR4);
  CLEAR_REG(RCC->PLL7CFGR4);
  CLEAR_REG(RCC->PLL8CFGR4);
  WRITE_REG(RCC->PLL4CFGR1, 0x10000001U);
  WRITE_REG(RCC->PLL5CFGR1, 0x10000001U);
  WRITE_REG(RCC->PLL6CFGR1, 0x10000001U);
  WRITE_REG(RCC->PLL7CFGR1, 0x10000001U);
  WRITE_REG(RCC->PLL8CFGR1, 0x10000001U);
  CLEAR_REG(RCC->PLL4CFGR2);
  CLEAR_REG(RCC->PLL5CFGR2);
  CLEAR_REG(RCC->PLL6CFGR2);
  CLEAR_REG(RCC->PLL7CFGR2);
  CLEAR_REG(RCC->PLL8CFGR2);
  WRITE_REG(RCC->PLL4CFGR3, 0x04000000U);
  WRITE_REG(RCC->PLL5CFGR3, 0x04000000U);
  WRITE_REG(RCC->PLL6CFGR3, 0x04000000U);
  WRITE_REG(RCC->PLL7CFGR3, 0x04000000U);
  WRITE_REG(RCC->PLL8CFGR3, 0x04000000U);
  CLEAR_REG(RCC->PLL4CFGR5);
  CLEAR_REG(RCC->PLL5CFGR5);
  CLEAR_REG(RCC->PLL6CFGR5);
  CLEAR_REG(RCC->PLL7CFGR5);
  CLEAR_REG(RCC->PLL8CFGR5);
  CLEAR_REG(RCC->PLL4CFGR6);
  CLEAR_REG(RCC->PLL5CFGR6);
  CLEAR_REG(RCC->PLL6CFGR6);
  CLEAR_REG(RCC->PLL7CFGR6);
  CLEAR_REG(RCC->PLL8CFGR6);
  CLEAR_REG(RCC->PLL4CFGR7);
  CLEAR_REG(RCC->PLL5CFGR7);
  CLEAR_REG(RCC->PLL6CFGR7);
  CLEAR_REG(RCC->PLL7CFGR7);
  CLEAR_REG(RCC->PLL8CFGR7);

  /* Reset GFG */
  CLEAR_REG(RCC->MUXSELCFGR);

  /* Reset APBDIVx */
  CLEAR_REG(RCC->APB1DIVR);
  CLEAR_REG(RCC->APB2DIVR);
  CLEAR_REG(RCC->APB3DIVR);
  CLEAR_REG(RCC->APB4DIVR);
  CLEAR_REG(RCC->APBDBGDIVR);

  /* Reset HSITRIM value */
  CLEAR_REG(RCC->HSICFGR);

  /* Reset the Oscillator Enable Control registers */

  /* Reset MSITRIM value */
  CLEAR_REG(RCC->MSICFGR);

  /* Reset RCC Clock Source Interrupt Enable Register */
  WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSIKERON | RCC_OCENCLRR_HSEDIGBYP | RCC_OCENCLRR_HSEON |
            RCC_OCENCLRR_HSEKERON | RCC_OCENCLRR_HSEBYP);

