zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
  /* Clear all RCC interrupt flags */
#if defined(CORE_CA35)
  CLEAR_REG(RCC->C1CIESETR);
#elif defined(CORE_CM33)
  CLEAR_REG(RCC->C2CIESETR);
#endif /* CORE_CA35 */

  /* Clear all RCC Reset Flags */
  CLEAR_REG(RCC->HWRSTSCLRR);

  /* Adapt Systick interrupt period */
  return (HAL_InitTick(TICK_INT_PRIORITY));
}

/**
  * @brief  Initialize the RCC Oscillators according to the specified parameters in the
  *         RCC_OscInitTypeDef.
  * @param  pRCC_OscInitStruct  pointer to an RCC_OscInitTypeDef structure that
  *         contains the configuration information for the RCC Oscillators.
  * @note   The PLL is not disabled when used as system clock.
  * @note   Transitions LSE Bypass to LSE On and LSE On to LSE Bypass are not
  *         supported by this function. User should request a transition to LSE Off
  *         first and then LSE On or LSE Bypass.
  * @note   Transition HSE Bypass to HSE On and HSE On to HSE Bypass are not
  *         supported by this function. User should request a transition to HSE Off
  *         first and then HSE On or HSE Bypass.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCC_OscConfig(const RCC_OscInitTypeDef  *pRCC_OscInitStruct)
{
  uint32_t tickstart;
  uint32_t backup_domain;
  uint32_t backupdomain_mask;
  uint32_t backupdomain_reg;
  /* Check Null pointer */
  if (pRCC_OscInitStruct == NULL)
  {
    return HAL_ERROR;
  }
#if defined(PWR_BDCR1_DBD3P)
  backupdomain_mask = PWR_BDCR1_DBD3P;
  backupdomain_reg  = PWR->BDCR1;
#else
  backupdomain_mask = PWR_BDCR_DBP;
  backupdomain_reg  = PWR->BDCR;
#endif /* PWR_BDCR1_DBD3P */
  /* Check the parameters */
  assert_param(IS_RCC_OSCILLATORTYPE(pRCC_OscInitStruct->OscillatorType));

  /*------------------------------- HSE Configuration ------------------------*/
  if (((pRCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSE) == RCC_OSCILLATORTYPE_HSE)
  {
    /* Check the parameters */
    assert_param(IS_RCC_HSE(pRCC_OscInitStruct->HSEState));

    /* When the HSE is used somewhere in the system it will not be disabled */
    if (RCC_is_hse_in_use() != 0U)
    {
      if (pRCC_OscInitStruct->HSEState != (RCC->OCENSETR & RCC_HSE_BYPASS_DIGITAL))
      {
        return HAL_ERROR;
      }
    }
    else
    {
      /* Turning HSE off is needed before configuring */
      LL_RCC_HSE_Disable();
      /* Get Start Tick*/
      tickstart = HAL_GetTick();

      /* Wait till LSE is stopped */
      while (__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) == SET)
      {
        if ((HAL_GetTick() - tickstart) > HSE_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }

      LL_RCC_HSE_DisableBypass();
      LL_RCC_HSE_DisableDigBypass();

      /* Configure HSE oscillator */
      if (pRCC_OscInitStruct->HSEState == RCC_HSE_BYPASS_DIGITAL)
      {
        LL_RCC_HSE_EnableDigBypass();
      }
      else if (pRCC_OscInitStruct->HSEState == RCC_HSE_BYPASS)
      {
        LL_RCC_HSE_EnableBypass();
      }
      else
      {
        /* do nothing */
      }
      /* Enable oscillator */
      LL_RCC_HSE_Enable();

      /* Get Start Tick*/
      tickstart = HAL_GetTick();

      /* Wait till HSE is ready */
      while (__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) == RESET)
      {
        if ((HAL_GetTick() - tickstart) > HSE_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  /*----------------------------- HSI Configuration --------------------------*/
  if (((pRCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSI) == RCC_OSCILLATORTYPE_HSI)
  {
    /* Check the parameters */
    assert_param(IS_RCC_HSI(pRCC_OscInitStruct->HSIState));
    assert_param(IS_RCC_HSICALIBRATION_VALUE(pRCC_OscInitStruct->HSICalibrationValue));

    /* When the HSI is used as system clock it will not disabled */
    if (RCC_is_hsi_in_use() != 0U)
    {
      /* When HSI is used as system clock it will not disabled */
      if (pRCC_OscInitStruct->HSIState != RCC_HSI_ON)
      {
        return HAL_ERROR;
      }
      /* Otherwise, just the calibration is allowed */
      else
      {
        /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
        __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(pRCC_OscInitStruct->HSICalibrationValue);
      }
    }
    else
    {
      /* Check the HSI State */
      if ((pRCC_OscInitStruct->HSIState) != RCC_HSI_OFF)
      {
        /* Enable the Internal High Speed oscillator (HSI). */
        LL_RCC_HSI_Enable();

        /* Get Start Tick*/
        tickstart = HAL_GetTick();

        /* Wait till HSI is ready */
        while (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) == RESET)
        {
          if ((HAL_GetTick() - tickstart) > HSI_TIMEOUT_VALUE)
          {
            return HAL_TIMEOUT;
          }
        }

        /* Adjusts the Internal High Speed oscillator (HSI) calibration value */
        LL_RCC_HSI_SetCalibTrimming(pRCC_OscInitStruct->HSICalibrationValue);
      }
      else
      {
        /* Disable the Internal High Speed oscillator (HSI) */
        LL_RCC_HSI_Disable();

        /* Get Start Tick*/
        tickstart = HAL_GetTick();

        /* Wait till HSI is ready */
        while (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) != RESET)
        {
          if ((HAL_GetTick() - tickstart) > HSI_TIMEOUT_VALUE)
          {
            return HAL_TIMEOUT;
          }
        }
      }
    }
  }

  /*----------------------------- MSI Configuration --------------------------*/
  if (((pRCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_MSI) == RCC_OSCILLATORTYPE_MSI)
  {
    /* Check the parameters */
    assert_param(IS_RCC_MSI(pRCC_OscInitStruct->MSIState));
    assert_param(IS_RCC_MSICALIBRATION_VALUE(pRCC_OscInitStruct->MSICalibrationValue));

    /* When the MSI is used as system clock it will not be disabled */
    if (RCC_is_msi_in_use() != 0U)
    {
      if (pRCC_OscInitStruct->MSIState != RCC_MSI_ON)
      {
        return HAL_ERROR;
      }
      /* Otherwise, just the calibration is allowed */
      else
      {
        /* Adjusts the Internal High Speed oscillator (MSI) calibration value */
        LL_RCC_MSI_SetCalibTrimming(pRCC_OscInitStruct->MSICalibrationValue);
      }
    }
    else
    {
      /* Check the MSI State */
      if ((pRCC_OscInitStruct->MSIState) != RCC_MSI_OFF)
      {
        if (HAL_IS_BIT_CLR(backupdomain_reg, backupdomain_mask))
        {
          backup_domain = 1;

