zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
          /* Enable write access to Backup domain */
#if defined(PWR_BDCR1_DBD3P)
          HAL_PWR_EnableBkUpD3Access();
#else
          HAL_PWR_EnableBkUpAccess();
#endif /* PWR_BDCR1_DBD3P */

          /* Wait for Backup domain Write protection disable */
          tickstart = HAL_GetTick();
#if defined(PWR_BDCR1_DBD3P)
          while ((PWR->BDCR1 & backupdomain_mask) == (uint32_t)RESET)
#else
          while ((PWR->BDCR & backupdomain_mask) == (uint32_t)RESET)
#endif /* PWR_BDCR1_DBD3P */
          {
            if ((HAL_GetTick() - tickstart) > DBP_TIMEOUT_VALUE)
            {
              return HAL_TIMEOUT;
            }
          }
        }
        else
        {
          backup_domain = 0;
        }

#if defined(RCC_BDCR_MSIFREQSEL)
        if (pRCC_OscInitStruct->MSIFrequency == RCC_MSI_4MHZ)
        {
          CLEAR_BIT(RCC->BDCR, RCC_BDCR_MSIFREQSEL);
        }
        else
        {
          SET_BIT(RCC->BDCR, RCC_BDCR_MSIFREQSEL);
        }
#endif /* RCC_BDCR_MSIFREQSEL */

        /* Enable the Internal High Speed oscillator (MSI). */
#if defined(RCC_OCENSETR_MSION)
        SET_BIT(RCC->OCENSETR, RCC_OCENSETR_MSION);
#elif defined(RCC_D3DCR_MSION)
        SET_BIT(RCC->D3DCR, RCC_D3DCR_MSION);
#endif /* RCC_OCENSETR_MSION */

        /* Get Start Tick*/
        tickstart = HAL_GetTick();

        /* Wait till MSI is ready */
        while (__HAL_RCC_GET_FLAG(RCC_FLAG_MSIRDY) == RESET)
        {
          if ((HAL_GetTick() - tickstart) > MSI_TIMEOUT_VALUE)
          {
            return HAL_TIMEOUT;
          }
        }

        /* Adjusts the Internal High Speed oscillator (MSI) calibration value */
        __HAL_RCC_MSI_CALIBRATIONVALUE_ADJUST(pRCC_OscInitStruct->MSICalibrationValue);

        /* Enable backup domain write protection */
        if (backup_domain == 1U)
        {
#if defined(PWR_BDCR1_DBD3P)
          HAL_PWR_EnableBkUpD3Access();
#else
          HAL_PWR_EnableBkUpAccess();
#endif /* PWR_BDCR1_DBD3P */
        }
      }
      else
      {
        /* Disable the Internal High Speed oscillator (MSI) */
#if defined(RCC_OCENSETR_MSION)
        CLEAR_BIT(RCC->OCENCLRR, RCC_OCENCLRR_MSION);
#elif defined(RCC_D3DCR_MSION)
        CLEAR_BIT(RCC->D3DCR, RCC_D3DCR_MSION);
#endif /* RCC_OCENSETR_MSION */
      }
    }
  }

  /*------------------------------ LSI Configuration -------------------------*/
  if (((pRCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSI) == RCC_OSCILLATORTYPE_LSI)
  {
    /* Check the parameters */
    assert_param(IS_RCC_LSI(pRCC_OscInitStruct->LSIState));

    if (RCC_is_lsi_in_use() != 0U)
    {
      if (pRCC_OscInitStruct->LSIState != RCC_LSI_ON)
      {
        return HAL_ERROR;
      }
      /* Otherwise, just the calibration is allowed */
    }

    if (HAL_IS_BIT_CLR(backupdomain_reg, backupdomain_mask))
    {
      backup_domain = 1;

      /* Enable write access to Backup domain */
#if defined(PWR_BDCR1_DBD3P)
      HAL_PWR_EnableBkUpD3Access();
#else
      HAL_PWR_EnableBkUpAccess();
#endif /* PWR_BDCR1_DBD3P */

      /* Wait for Backup domain Write protection disable */
      tickstart = HAL_GetTick();

#if defined(PWR_BDCR1_DBD3P)
      while ((PWR->BDCR1 & backupdomain_mask) == (uint32_t)RESET)
#else
      while ((PWR->BDCR & backupdomain_mask) == (uint32_t)RESET)
#endif /* PWR_BDCR1_DBD3P */
      {
        if ((HAL_GetTick() - tickstart) > DBP_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      backup_domain = 0;
    }

    /* Check the LSI State */
    if (pRCC_OscInitStruct->LSIState == RCC_LSI_ON)
    {
      /* Enable the Internal Low Speed oscillator (LSI). */
      __HAL_RCC_LSI_ENABLE();

      /* Get Start Tick*/
      tickstart = HAL_GetTick();

      /* Wait till LSI is ready */
      while (__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY) == RESET)
      {
        if ((HAL_GetTick() - tickstart) > LSI_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      if (pRCC_OscInitStruct->LSIState == RCC_LSI_OFF)
      {
        /* Disable the Internal Low Speed oscillator (LSI). */
        __HAL_RCC_LSI_DISABLE();

        /* Get Start Tick*/
        tickstart = HAL_GetTick();

        /* Wait till LSI is ready */
        while (__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY) != RESET)
        {
          if ((HAL_GetTick() - tickstart) > LSI_TIMEOUT_VALUE)
          {
            return HAL_TIMEOUT;
          }
        }
      }
    }

    if (backup_domain == 1U)
    {
#if defined(PWR_BDCR1_DBD3P)
      HAL_PWR_DisableBkUpD3Access();
#else
      HAL_PWR_DisableBkUpAccess();
#endif /* PWR_BDCR1_DBD3P */

    }
  }

  /*------------------------------ LSE Configuration -------------------------*/
  if (((pRCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSE) == RCC_OSCILLATORTYPE_LSE)
  {
    /* Check the parameters */
    assert_param(IS_RCC_LSE(pRCC_OscInitStruct->LSEState));

    if (RCC_is_lse_in_use() != 0U)
    {
      if (__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) != RESET)
      {
        if (pRCC_OscInitStruct->LSEState != (RCC->BDCR & RCC_LSE_BYPASS_DIGITAL))
        {
          return HAL_ERROR;
        }
      }
      /* Otherwise, just the calibration is allowed */
    }

    if (HAL_IS_BIT_CLR(backupdomain_reg, backupdomain_mask))
    {
      backup_domain = 1;

      /* Enable write access to Backup domain */
#if defined(PWR_BDCR1_DBD3P)
      HAL_PWR_EnableBkUpD3Access();
#else
      HAL_PWR_EnableBkUpAccess();
#endif /* PWR_BDCR1_DBD3P */

      /* Wait for Backup domain Write protection disable */
      tickstart = HAL_GetTick();

#if defined(PWR_BDCR1_DBD3P)
      while ((PWR->BDCR1 & backupdomain_mask) == (uint32_t)RESET)
#else
      while ((PWR->BDCR & backupdomain_mask) == (uint32_t)RESET)
#endif /* PWR_BDCR1_DBD3P */
      {
        if ((HAL_GetTick() - tickstart) > DBP_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      backup_domain = 0;
    }

    /* Turning LSE off is needed before configuring */
    LL_RCC_LSE_Disable();

    /* Get Start Tick*/
    tickstart = HAL_GetTick();

    /* Wait till LSE is stopped */
    while (__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) == SET)
    {
      if ((HAL_GetTick() - tickstart) > LSE_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

    LL_RCC_LSE_DisableBypass();
    LL_RCC_LSE_DisableDigBypass();

