zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
    if (pRCC_OscInitStruct->LSEState != RCC_LSE_OFF)
    {
      if (pRCC_OscInitStruct->LSEState == RCC_LSE_BYPASS_DIGITAL)
      {
        LL_RCC_LSE_EnableDigBypass();
      }
      else if (pRCC_OscInitStruct->LSEState == RCC_LSE_BYPASS)
      {
        LL_RCC_LSE_EnableBypass();
      }
      else
      {
        /* do nothing */
      }
      /* LSEDrv */
      LL_RCC_LSE_SetDriveCapability(pRCC_OscInitStruct->LSEDriveValue);

      /* Enable oscillator */
      LL_RCC_LSE_Enable();

      /* Get Start Tick*/
      tickstart = HAL_GetTick();

      /* Wait till LSE is ready */
      while (__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) == RESET)
      {
        if ((HAL_GetTick() - tickstart) > LSE_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }

    if (backup_domain == 1U)
    {
#if defined(PWR_BDCR1_DBD3P)
      HAL_PWR_DisableBkUpD3Access();
#else
      HAL_PWR_DisableBkUpAccess();
#endif /* PWR_BDCR1_DBD3P */
    }
  }

  return HAL_OK;
}

/**
  * @brief  Initialize the CPU, AHB, APB busses and RTC clocks according to the specified
  *         parameters in the pRCC_ClkInitStruct.
  * @param  pRCC_ClkInitStruct  pointer to an RCC_ClkInitTypeDef structure that
  *         contains the configuration information for the RCC peripheral.
  * @param  FLatency  FLASH Latency
  *          This parameter is not used on STM32MP25.
  *
  * @note   The HSI is used by default as system clock source after
  *         startup from Reset, wake-up from STANDBY mode. The HSI frequency is 64 MHz.
  * @note   The HSI can be selected as system clock source after wakeup
  *         from STOP modes or in case of failure of the HSE used directly or indirectly
  *         as system clock (if the Clock Security System CSS is enabled).
  * @note   A switch from one clock source to another occurs only if the target
  *         clock source is ready (clock stable after startup delay or PLL locked).
  *         If a clock source which is not yet ready is selected, the switch will
  *         occur when the clock source is ready.
  * @note   You can use HAL_RCC_GetClockConfig() function to know which clock is
  *         currently used as system clock source.
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCC_ClockConfig(const RCC_ClkInitTypeDef   *const pRCC_ClkInitStruct, uint32_t FLatency)
{
  uint32_t tickstart;
  uint32_t backup_domain;
  UNUSED(FLatency);/*unused variable*/
  uint32_t backupdomain_mask;

#if defined(PWR_BDCR1_DBD3P)
  backupdomain_mask = PWR_BDCR1_DBD3P;
#else
  backupdomain_mask = PWR_BDCR_DBP;
#endif /* PWR_BDCR1_DBD3P */

  /* Check Null pointer */
  if (pRCC_ClkInitStruct == NULL)
  {
    return HAL_ERROR;
  }

  assert_param(IS_RCC_CLOCKTYPE(pRCC_ClkInitStruct->ClockType));

  /* Process LSMCUDIV to avoid potential crash, because ck_icn_ls_mcu exceeds his limit,
     when maximum frequency is applied to ck_icn_hs_mcu."
  */
  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_LS_MCU) == RCC_CLOCKTYPE_ICN_LS_MCU)
  {
    /* Cross bar is inherited from ICN_HS_MCU */

    /* Set LSMCUDIV */
    RCC->LSMCUDIVR = pRCC_ClkInitStruct->ICN_LSMCU_Div;

    /* Wait for divider to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->LSMCUDIVR & RCC_LSMCUDIVR_LSMCUDIVRDY) == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > LSMCUDIV_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_HS_MCU) == RCC_CLOCKTYPE_ICN_HS_MCU)
  {
    /* Set flexgen dividers */
    /* if divider is < 64, use findiv */
    if (pRCC_ClkInitStruct->ICN_HS_MCU.Div <= 64U)
    {
      RCC->PREDIVxCFGR[0] = 0x0;
      RCC->FINDIVxCFGR[0] = ((pRCC_ClkInitStruct->ICN_HS_MCU.Div) - 1U) | (1U << 6);

      /* Wait for findiv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->FINDIVSR1 & 0x1U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > FINDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_HS_MCU.Div <= 128U)
    {
      RCC->FINDIVxCFGR[0] = ((pRCC_ClkInitStruct->ICN_HS_MCU.Div / 2U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[0] = 0x1;

      /* Wait for prediv & findiv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x1U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_HS_MCU.Div <= 256U)
    {
      RCC->FINDIVxCFGR[0] = ((pRCC_ClkInitStruct->ICN_HS_MCU.Div / 4U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[0] = 0x3;

      /* Wait for prediv & findiv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x1U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      RCC->FINDIVxCFGR[0] = ((pRCC_ClkInitStruct->ICN_HS_MCU.Div / 1024U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[0] = 0x3FF;

      /* Wait for prediv & findiv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x1U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }

    /* Set cross bar source */
    LL_RCC_SetCrossbarSource(0, pRCC_ClkInitStruct->ICN_HS_MCU.XBAR_ClkSrc);

    /* Wait for xbar to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->XBARxCFGR[0] & 0x80U) != (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > XBAR_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

#if defined(CORE_CM33)
    /* Update SystemCoreClock */
    SystemCoreClockUpdate();
    /* Adapt Systick interrupt period */
    if (HAL_InitTick(TICK_INT_PRIORITY) != HAL_OK)
    {
      return HAL_ERROR;
    }
#endif /* CORE_CM33 */
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_APB1) == RCC_CLOCKTYPE_ICN_APB1)
  {
    /* Set APB1 divider */
    LL_RCC_SetAPB1Prescaler(pRCC_ClkInitStruct->APB1_Div);

    /* Wait for divider to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->APB1DIVR & RCC_APB1DIVR_APB1DIVRDY) == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > APB1DIV_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

