zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_APB2) == RCC_CLOCKTYPE_ICN_APB2)
  {
    /* Set APB1 divider */
    LL_RCC_SetAPB2Prescaler(pRCC_ClkInitStruct->APB2_Div);

    /* Wait for divider to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->APB2DIVR & RCC_APB2DIVR_APB2DIVRDY) == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > APB2DIV_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_APB3) == RCC_CLOCKTYPE_ICN_APB3)
  {
    /* Set APB1 divider */
    LL_RCC_SetAPB3Prescaler(pRCC_ClkInitStruct->APB3_Div);

    /* Wait for divider to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->APB3DIVR & RCC_APB3DIVR_APB3DIVRDY) == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > APB3DIV_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_APB4) == RCC_CLOCKTYPE_ICN_APB4)
  {
    /* Set APB1 divider */
    LL_RCC_SetAPB4Prescaler(pRCC_ClkInitStruct->APB4_Div);

    /* Wait for divider to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->APB4DIVR & RCC_APB4DIVR_APB4DIVRDY) == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > APB4DIV_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_APBDBG) == RCC_CLOCKTYPE_ICN_APBDBG)
  {
    /* Set APBDBG divider */
    LL_RCC_SetAPBDBGPrescaler(pRCC_ClkInitStruct->APBDBG_Div);

    /* Wait for divider to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->APBDBGDIVR & RCC_APBDBGDIVR_APBDBGDIVRDY) == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > APBDBGDIV_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_SDMMC) == RCC_CLOCKTYPE_ICN_SDMMC)
  {
    /* Set flexgen dividers */
    /* if divider is < 64, use findiv */
    if (pRCC_ClkInitStruct->ICN_SDMMC.Div <= 64U)
    {
      RCC->PREDIVxCFGR[1] = 0x0;
      RCC->FINDIVxCFGR[1] = ((pRCC_ClkInitStruct->ICN_SDMMC.Div) - 1U) | (1U << 6);

      /* Wait for findiv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->FINDIVSR1 & 0x2U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > FINDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_SDMMC.Div <= 128U)
    {
      RCC->FINDIVxCFGR[1] = ((pRCC_ClkInitStruct->ICN_SDMMC.Div / 2U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[1] = 0x1;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x2U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_SDMMC.Div <= 256U)
    {
      RCC->FINDIVxCFGR[1] = ((pRCC_ClkInitStruct->ICN_SDMMC.Div / 4U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[1] = 0x3;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x2U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      RCC->FINDIVxCFGR[1] = ((pRCC_ClkInitStruct->ICN_SDMMC.Div / 1024U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[1] = 0x3FF;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x2U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }

    /* Set cross bar source */
    LL_RCC_SetCrossbarSource(1, pRCC_ClkInitStruct->ICN_SDMMC.XBAR_ClkSrc);

    /* Wait for xbar to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->XBARxCFGR[1] & 0x80U) != (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > XBAR_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_DDR) == RCC_CLOCKTYPE_ICN_DDR)
  {
    /* Set flexgen dividers */
    /* if divider is < 64, use findiv */
    if (pRCC_ClkInitStruct->ICN_DDR.Div <= 64U)
    {
      RCC->PREDIVxCFGR[2] = 0x0;
      RCC->FINDIVxCFGR[2] = ((pRCC_ClkInitStruct->ICN_DDR.Div) - 1U) | (1U << 6);

      /* Wait for findiv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->FINDIVSR1 & 0x4U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > FINDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_DDR.Div <= 128U)
    {
      RCC->FINDIVxCFGR[2] = ((pRCC_ClkInitStruct->ICN_DDR.Div / 2U) - 1U) | (1U << 6);;
      RCC->PREDIVxCFGR[2] = 0x1;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x4U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_DDR.Div <= 256U)
    {
      RCC->FINDIVxCFGR[2] = ((pRCC_ClkInitStruct->ICN_DDR.Div / 4U) - 1U) | (1U << 6);;
      RCC->PREDIVxCFGR[2] = 0x3;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x4U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      RCC->FINDIVxCFGR[2] = ((pRCC_ClkInitStruct->ICN_DDR.Div / 1024U) - 1U) | (1U << 6);;
      RCC->PREDIVxCFGR[2] = 0x3FF;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x4U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }

    /* Set cross bar source */
    LL_RCC_SetCrossbarSource(2, pRCC_ClkInitStruct->ICN_DDR.XBAR_ClkSrc);

    /* Wait for xbar to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->XBARxCFGR[2] & 0x80U) != (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > XBAR_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_DISPLAY) == RCC_CLOCKTYPE_ICN_DISPLAY)
  {
    /* Set flexgen dividers */
    /* if divider is < 64, use findiv */
    if (pRCC_ClkInitStruct->ICN_DISPLAY.Div <= 64U)
    {
      RCC->PREDIVxCFGR[3] = 0x0;
      RCC->FINDIVxCFGR[3] = ((pRCC_ClkInitStruct->ICN_DISPLAY.Div) - 1U) | (1U << 6);

      /* Wait for findiv to be ready */
      tickstart = HAL_GetTick();

