zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
      while ((RCC->FINDIVSR1 & 0x8U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > FINDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_DISPLAY.Div <= 128U)
    {
      RCC->FINDIVxCFGR[3] = ((pRCC_ClkInitStruct->ICN_DISPLAY.Div / 2U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[3] = 0x1;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x8U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_DISPLAY.Div <= 256U)
    {
      RCC->FINDIVxCFGR[3] = ((pRCC_ClkInitStruct->ICN_DISPLAY.Div / 4U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[3] = 0x3;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x8U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      RCC->FINDIVxCFGR[3] = ((pRCC_ClkInitStruct->ICN_DISPLAY.Div / 1024U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[3] = 0x3FF;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x8U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }

    /* Set cross bar source */
    LL_RCC_SetCrossbarSource(3, pRCC_ClkInitStruct->ICN_DISPLAY.XBAR_ClkSrc);

    /* Wait for xbar to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->XBARxCFGR[3] & 0x80U) != (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > XBAR_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_HCL) == RCC_CLOCKTYPE_ICN_HCL)
  {
    /* Set flexgen dividers */
    /* if divider is < 64, use findiv */
    if (pRCC_ClkInitStruct->ICN_HCL.Div <= 64U)
    {
      RCC->PREDIVxCFGR[4] = 0x0;
      RCC->FINDIVxCFGR[4] = ((pRCC_ClkInitStruct->ICN_HCL.Div) - 1U) | (1U << 6);

      /* Wait for findiv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->FINDIVSR1 & 0x10U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > FINDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_HCL.Div <= 128U)
    {
      RCC->FINDIVxCFGR[4] = ((pRCC_ClkInitStruct->ICN_HCL.Div / 2U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[4] = 0x1;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x10U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_HCL.Div <= 256U)
    {
      RCC->FINDIVxCFGR[4] = ((pRCC_ClkInitStruct->ICN_HCL.Div / 4U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[4] = 0x3;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x10U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      RCC->FINDIVxCFGR[4] = ((pRCC_ClkInitStruct->ICN_HCL.Div / 1024U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[4] = 0x3FF;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x10U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }

    /* Set cross bar source */
    LL_RCC_SetCrossbarSource(4, pRCC_ClkInitStruct->ICN_HCL.XBAR_ClkSrc);

    /* Wait for xbar to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->XBARxCFGR[4] & 0x80U) != (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > XBAR_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_NIC) == RCC_CLOCKTYPE_ICN_NIC)
  {
    /* Set flexgen dividers */
    /* if divider is < 64, use findiv */
    if (pRCC_ClkInitStruct->ICN_NIC.Div <= 64U)
    {
      RCC->PREDIVxCFGR[5] = 0x0;
      RCC->FINDIVxCFGR[5] = ((pRCC_ClkInitStruct->ICN_NIC.Div) - 1U) | (1U << 6);

      /* Wait for findiv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->FINDIVSR1 & 0x20U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > FINDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_NIC.Div <= 128U)
    {
      RCC->FINDIVxCFGR[5] = ((pRCC_ClkInitStruct->ICN_NIC.Div / 2U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[5] = 0x1;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x20U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_NIC.Div <= 256U)
    {
      RCC->FINDIVxCFGR[5] = ((pRCC_ClkInitStruct->ICN_NIC.Div / 4U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[5] = 0x3;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x20U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      RCC->FINDIVxCFGR[5] = ((pRCC_ClkInitStruct->ICN_NIC.Div / 1024U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[5] = 0x3FF;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x20U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }

    /* Set cross bar source */
    LL_RCC_SetCrossbarSource(5, pRCC_ClkInitStruct->ICN_NIC.XBAR_ClkSrc);

    /* Wait for xbar to be ready */
    tickstart = HAL_GetTick();

