zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
    while ((RCC->XBARxCFGR[5] & 0x80U) != (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > XBAR_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_ICN_VID) == RCC_CLOCKTYPE_ICN_VID)
  {
    /* Set flexgen dividers */
    /* if divider is < 64, use findiv */
    if (pRCC_ClkInitStruct->ICN_VID.Div <= 64U)
    {
      RCC->PREDIVxCFGR[6] = 0x0;
      RCC->FINDIVxCFGR[6] = ((pRCC_ClkInitStruct->ICN_VID.Div) - 1U) | (1U << 6);

      /* Wait for findiv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->FINDIVSR1 & 0x40U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > FINDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_VID.Div <= 128U)
    {
      RCC->FINDIVxCFGR[6] = ((pRCC_ClkInitStruct->ICN_VID.Div / 2U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[6] = 0x1;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x40U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else if (pRCC_ClkInitStruct->ICN_VID.Div <= 256U)
    {
      RCC->FINDIVxCFGR[6] = ((pRCC_ClkInitStruct->ICN_VID.Div / 4U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[6] = 0x3;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x40U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      RCC->FINDIVxCFGR[6] = ((pRCC_ClkInitStruct->ICN_VID.Div / 1024U) - 1U) | (1U << 6);
      RCC->PREDIVxCFGR[6] = 0x3FF;

      /* Wait for prediv to be ready */
      tickstart = HAL_GetTick();

      while ((RCC->PREDIVSR1 & 0x40U) != (uint32_t)RESET)
      {
        if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }

    /* Set cross bar source */
    LL_RCC_SetCrossbarSource(6, pRCC_ClkInitStruct->ICN_VID.XBAR_ClkSrc);

    /* Wait for xbar to be ready */
    tickstart = HAL_GetTick();

    while ((RCC->XBARxCFGR[6] & 0x80U) != (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > XBAR_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((pRCC_ClkInitStruct->ClockType & RCC_CLOCKTYPE_RTC) == RCC_CLOCKTYPE_RTC)
  {
#if defined(PWR_BDCR1_DBD3P)
    if (HAL_IS_BIT_CLR(PWR->BDCR1, PWR_BDCR1_DBD3P))
#else
    if (HAL_IS_BIT_CLR(PWR->BDCR, PWR_BDCR_DBP))
#endif /* PWR_BDCR1_DBD3P */
    {
      backup_domain = 1;

      /* Enable write access to Backup domain */
#if defined(PWR_BDCR1_DBD3P)
      HAL_PWR_EnableBkUpD3Access();
#else
      HAL_PWR_EnableBkUpAccess();
#endif /* PWR_BDCR1_DBD3P */

      /* Wait for Backup domain Write protection disable */
      tickstart = HAL_GetTick();

#if defined(PWR_BDCR1_DBD3P)
      while ((PWR->BDCR1 & backupdomain_mask) == (uint32_t)RESET)
#else
      while ((PWR->BDCR & backupdomain_mask) == (uint32_t)RESET)
#endif /* PWR_BDCR1_DBD3P */
      {
        if ((HAL_GetTick() - tickstart) > DBP_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
    else
    {
      backup_domain = 0;
    }

    if (pRCC_ClkInitStruct->RTCState == RCC_RTC_ON)
    {
      LL_RCC_EnableRTC();

      LL_RCC_SetRTC_HSEPrescaler(pRCC_ClkInitStruct->RTC_Div);

      LL_RCC_SetRTCClockSource(pRCC_ClkInitStruct->RTC_Src);

      __HAL_RCC_RTC_CLK_ENABLE();
    }
    else
    {
      __HAL_RCC_RTC_CLK_DISABLE();

      LL_RCC_DisableRTC();
    }

    if (backup_domain == 1U)
    {
#if defined(PWR_BDCR1_DBD3P)
      HAL_PWR_DisableBkUpD3Access();
#else
      HAL_PWR_DisableBkUpAccess();
#endif /* PWR_BDCR1_DBD3P */
    }
  }

  return HAL_OK;
}

#if defined(CORE_CA35)
uint32_t HAL_RCC_GetCA35Freq(void)
{
  uint32_t source_clock;
  uint32_t Frequency;

  /* Check CA35 source (can be EXT2F or PLL1) */
  HAL_RCCEx_CA35SS_GetCA35SSClockSource(&source_clock);

  if (source_clock == 0)
  {
    /* Return PLL1 frequency */
    Frequency = HAL_RCCEx_CA35SS_GetPLL1ClockFreq();
  }
  else
  {
    Frequency = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_CPU1_EXT2F);
    if ((CA35SSC->CHGCLKREQ_RW & CA35SSC_CHGCLKREQ_RW_ARM_DIVSELACK) != CA35SSC_CHGCLKREQ_RW_ARM_DIVSELACK)
    {
      Frequency /= 2;
    }
  }

  return Frequency;
}
#endif /* CORE_CA35 */

/**
  * @}
  */

/** @defgroup RCC_Exported_Functions_Group2 Peripheral Control functions
  * @brief   RCC clocks control functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to:

    (+) Output clock to MCO pin.
    (+) Retrieve current clock frequencies.
    (+) Enable the Clock Security System.

@endverbatim
  * @{
  */

/**
  * @brief  Select the clock source to output on MCO pin.
  * @note   PA8 should be configured in alternate function mode.
  * @param  RCC_MCOx specifies the output direction for the clock source.
  *          For STM32MP25 family this parameter can have two values:
  *            @arg @ref RCC_MCO1_PC9  Clock source to output on MCO1 pin(PC9).
  *            @arg @ref RCC_MCO1_PF11 Clock source to output on MCO1 pin(PF11).
  *            @arg @ref RCC_MCO1_PI6  Clock source to output on MCO1 pin(PI6).
  *            @arg @ref RCC_MCO1_PZ5  Clock source to output on MCO1 pin(PZ5).
  *            @arg @ref RCC_MCO2_PF10 Clock source to output on MCO2 pin(PF10).
  *            @arg @ref RCC_MCO2_PZ4  Clock source to output on MCO2 pin(PZ4).
  *            @arg @ref RCC_MCO2_PZ9  Clock source to output on MCO2 pin(PZ9).
  *            @arg @ref RCC_MCO1      Same as RCC_MCO1_PC9 (for other families compatibility).
  *            @arg @ref RCC_MCO2      Same as RCC_MCO2_PF10 (for other families compatibility).
  *            @arg @ref RCC_MCO       Same as RCC_MCO1 (for other families compatibility).
  * @param  RCC_MCOSource  specifies the clock source to output.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_MCO1SOURCE_NOCLOCK MCO1 is disabled
  *            @arg @ref RCC_MCO1SOURCE_CLKOBS  MCO1 source is Clock Observer 0
  *            @arg @ref RCC_MCO1SOURCE_PLL4    MCO1 source is PLL4 Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_PLL5    MCO1 source is PLL5 Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_PLL6    MCO1 source is PLL6 Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_PLL7    MCO1 source is PLL7 Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_PLL8    MCO1 source is PLL8 Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_HSI     MCO1 source is HSI Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_HSE     MCO1 source is HSE Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_MSI     MCO1 source is MSI Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_HSI_KER MCO1 source is HSI_KER Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_HSE_KER MCO1 source is HSE_KER Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_MSI_KER MCO1 source is MSI_KER Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_SPDIF   MCO1 source is SPDIF Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_I2S     MCO1 source is I2S Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_LSI     MCO1 source is LSI Through Crossbar
  *            @arg @ref RCC_MCO1SOURCE_LSE     MCO1 source is LSE Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_NOCLOCK MCO2 is disabled
  *            @arg @ref RCC_MCO2SOURCE_CLKOBS  MCO2 source is Clock Observer 0
  *            @arg @ref RCC_MCO2SOURCE_PLL4    MCO2 source is PLL4 Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_PLL5    MCO2 source is PLL5 Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_PLL6    MCO2 source is PLL6 Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_PLL7    MCO2 source is PLL7 Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_PLL8    MCO2 source is PLL8 Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_HSI     MCO2 source is HSI Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_HSE     MCO2 source is HSE Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_MSI     MCO2 source is MSI Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_HSI_KER MCO2 source is HSI_KER Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_HSE_KER MCO2 source is HSE_KER Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_MSI_KER MCO2 source is MSI_KER Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_SPDIF   MCO2 source is SPDIF Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_I2S     MCO2 source is I2S Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_LSI     MCO2 source is LSI Through Crossbar
  *            @arg @ref RCC_MCO2SOURCE_LSE     MCO2 source is LSE Through Crossbar
  * @param  RCC_MCODiv specifies the MCO prescaler.
  *          This parameter can be only be used when MCO source is through Crossbar
  *          This parameter can be any value supported by Crossbar which are
  *             1    to 64    all values
  *             66   to 128   only values multiple of 2
  *             130  to 256   only values multiple of 4
  *             1024 to 65536 only values multiple of 1024
  * @retval None
  */
void HAL_RCC_MCOConfig(uint32_t RCC_MCOx, uint32_t RCC_MCOSource, uint32_t RCC_MCODiv)
{
  GPIO_InitTypeDef gpio_initstruct;
  uint32_t mcoindex;
  uint32_t mco_gpio_index;
  GPIO_TypeDef *mco_gpio_port;
  RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInit;

