zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
  assert_param(IS_RCC_MCO(RCC_MCOx));

  /* Common GPIO init parameters */
  gpio_initstruct.Mode      = GPIO_MODE_AF_PP;
  gpio_initstruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  gpio_initstruct.Pull      = GPIO_NOPULL;

  /* Get MCOx selection */
  mcoindex = RCC_MCOx & RCC_MCO_INDEX_MASK;

  /* Get MCOx GPIO Port */
  mco_gpio_port = RCC_GET_MCO_GPIO_PORT(RCC_MCOx);
  assert_param(IS_GPIO_ALL_INSTANCE(mco_gpio_port));

  /* GPIO Clock Enable */
  mco_gpio_index = RCC_GET_MCO_GPIO_INDEX(RCC_MCOx);
  switch (mco_gpio_index)
  {
    case 2 :
      __HAL_RCC_GPIOC_CLK_ENABLE();
      break;
    case 5 :
      __HAL_RCC_GPIOF_CLK_ENABLE();
      break;
    case 8 :
      __HAL_RCC_GPIOI_CLK_ENABLE();
      break;
    case 11 :
      __HAL_RCC_GPIOZ_CLK_ENABLE();
      break;
    default :
      /* No MCO output on other GPIO ports */
      break;
  }

  /* Configure the MCOx pin in alternate function mode */
  gpio_initstruct.Pin = RCC_GET_MCO_GPIO_PIN(RCC_MCOx);
  gpio_initstruct.Alternate = RCC_GET_MCO_GPIO_AF(RCC_MCOx);
  HAL_GPIO_Init(mco_gpio_port, &gpio_initstruct);

  if (mcoindex == RCC_MCO1_INDEX)
  {
    assert_param(IS_RCC_MCODIV(RCC_MCODiv));
    assert_param(IS_RCC_MCO1SOURCE(RCC_MCOSource));

    if (RCC_MCOSource == RCC_MCO1SOURCE_NOCLOCK)
    {
      /* Disable MCO1 */
      __HAL_RCC_MCO1_DISABLE();
    }
    else if (RCC_MCOSource == RCC_MCO1SOURCE_CLKOBS)
    {
      /* Enable MCO1 and set source to Clock Observer 0 */
      __HAL_RCC_MCO1_ENABLE();
      SET_BIT(RCC->MCO1CFGR, RCC_MCO1CFGR_MCO1SEL);
    }
    else
    {
      /* Enable MCO1, set source to Crossbar and configure Crossbar channel source */
      __HAL_RCC_MCO1_ENABLE();
      CLEAR_BIT(RCC->MCO1CFGR, RCC_MCO1CFGR_MCO1SEL);
      RCC_PeriphCLKInit.XBAR_Channel = RCC_PERIPHCLK_MCO1;
      RCC_PeriphCLKInit.XBAR_ClkSrc = RCC_MCOSource & 0xFFUL;
      RCC_PeriphCLKInit.Div = RCC_MCODiv;
      (void)HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInit);
    }
  }
  else if (mcoindex == RCC_MCO2_INDEX)
  {
    assert_param(IS_RCC_MCODIV(RCC_MCODiv));
    assert_param(IS_RCC_MCO2SOURCE(RCC_MCOSource));

    if (RCC_MCOSource == RCC_MCO2SOURCE_NOCLOCK)
    {
      /* Disable MCO2 */
      __HAL_RCC_MCO2_DISABLE();
    }
    else if (RCC_MCOSource == RCC_MCO2SOURCE_CLKOBS)
    {
      /* Enable MCO2 and set source to Clock Observer 0 */
      __HAL_RCC_MCO2_ENABLE();
      SET_BIT(RCC->MCO2CFGR, RCC_MCO2CFGR_MCO2SEL);
    }
    else
    {
      /* Enable MCO2, set source to Crossbar and configure Crossbar channel source */
      __HAL_RCC_MCO2_ENABLE();
      CLEAR_BIT(RCC->MCO2CFGR, RCC_MCO2CFGR_MCO2SEL);
      RCC_PeriphCLKInit.XBAR_Channel = RCC_PERIPHCLK_MCO2;
      RCC_PeriphCLKInit.XBAR_ClkSrc = RCC_MCOSource & 0xFFUL;
      RCC_PeriphCLKInit.Div = RCC_MCODiv;
      (void)HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInit);
    }
  }
  else
  {
    /* nothing to do */
  }
}

/**
  * @brief  Get the pRCC_OscInitStruct according to the internal
  *         RCC configuration registers.
  * @param  pRCC_OscInitStruct  pointer to an RCC_OscInitTypeDef structure that
  *         will be filled with current OSCs config.
  * @retval None
  */
void HAL_RCC_GetOscConfig(RCC_OscInitTypeDef  *pRCC_OscInitStruct)
{
  uint32_t temp_reg;

  pRCC_OscInitStruct->OscillatorType = RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_HSI |
                                       RCC_OSCILLATORTYPE_MSI | RCC_OSCILLATORTYPE_LSI |
                                       RCC_OSCILLATORTYPE_LSE;

  /* Get HSE Config */
  temp_reg = RCC->OCENSETR;
  if ((temp_reg & RCC_HSE_BYPASS_DIGITAL) == RCC_HSE_BYPASS_DIGITAL)
  {
    pRCC_OscInitStruct->HSEState = RCC_HSE_BYPASS_DIGITAL;
  }
  else if ((temp_reg & RCC_HSE_BYPASS) == RCC_HSE_BYPASS)
  {
    pRCC_OscInitStruct->HSEState = RCC_HSE_BYPASS;
  }
  else if ((temp_reg & RCC_HSE_ON) == RCC_HSE_ON)
  {
    pRCC_OscInitStruct->HSEState = RCC_HSE_ON;
  }
  else
  {
    pRCC_OscInitStruct->HSEState = RCC_HSE_OFF;
  }

  /* Get HSI Config */
  temp_reg = RCC->OCENSETR;
  if ((temp_reg & RCC_HSI_ON) == RCC_HSI_ON)
  {
    pRCC_OscInitStruct->HSIState = RCC_HSI_ON;
  }
  else
  {
    pRCC_OscInitStruct->HSIState = RCC_HSI_OFF;
  }
  pRCC_OscInitStruct->HSICalibrationValue = LL_RCC_HSI_GetCalibration();

  /* Get MSI Config */
#if defined(RCC_D3DCR_MSION)
  temp_reg = RCC->D3DCR;
#else
  temp_reg = RCC->OCENSETR;
#endif /* RCC_D3DCR_MSION */

  if ((temp_reg & RCC_MSI_ON) == RCC_MSI_ON)
  {
    pRCC_OscInitStruct->MSIState = RCC_MSI_ON;
  }
  else
  {
    pRCC_OscInitStruct->MSIState = RCC_MSI_OFF;
  }
  pRCC_OscInitStruct->MSICalibrationValue = LL_RCC_MSI_GetCalibTrimming();
#if defined(RCC_BDCR_MSIFREQSEL)
  if (READ_BIT(RCC->BDCR, RCC_BDCR_MSIFREQSEL) == 0U)
  {
    pRCC_OscInitStruct->MSIFrequency = RCC_MSI_4MHZ;
  }
  else
#endif /* RCC_BDCR_MSIFREQSEL */
  {
    pRCC_OscInitStruct->MSIFrequency = RCC_MSI_16MHZ;
  }

  /* Get LSI Config */
  temp_reg = RCC->BDCR;
  if ((temp_reg & RCC_LSI_ON) == RCC_LSI_ON)
  {
    pRCC_OscInitStruct->LSIState = RCC_LSI_ON;
  }
  else
  {
    pRCC_OscInitStruct->LSIState = RCC_LSI_OFF;
  }

  /* Get LSE Config */
  temp_reg = RCC->BDCR;
  if ((temp_reg & RCC_LSE_BYPASS_DIGITAL) == RCC_LSE_BYPASS_DIGITAL)
  {
    pRCC_OscInitStruct->LSEState = RCC_LSE_BYPASS_DIGITAL;
  }
  else if ((temp_reg & RCC_LSE_BYPASS) == RCC_LSE_BYPASS)
  {
    pRCC_OscInitStruct->LSEState = RCC_LSE_BYPASS;
  }
  else if ((temp_reg & RCC_LSE_ON) == RCC_LSE_ON)
  {
    pRCC_OscInitStruct->LSEState = RCC_LSE_ON;
  }
  else
  {
    pRCC_OscInitStruct->LSEState = RCC_LSE_OFF;
  }
  pRCC_OscInitStruct->LSEDriveValue = LL_RCC_LSE_GetDriveCapability();
}

/**
  * @brief  Get the pRCC_ClkInitStruct according to the internal
  *         RCC configuration registers.
  * @param  pRCC_ClkInitStruct  pointer to an RCC_ClkInitTypeDef structure that
  *         will be filled with current clock configuration.
  * @param  pFLatency  This parameter is not used on STM32MP25.
  * @retval None
  */
void HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef  *pRCC_ClkInitStruct, const uint32_t *pFLatency)
{
  pRCC_ClkInitStruct->ClockType = RCC_CLOCKTYPE_ICN_HS_MCU | RCC_CLOCKTYPE_ICN_LS_MCU | RCC_CLOCKTYPE_ICN_SDMMC |
                                  RCC_CLOCKTYPE_ICN_DDR | RCC_CLOCKTYPE_ICN_DISPLAY | RCC_CLOCKTYPE_ICN_HCL |
                                  RCC_CLOCKTYPE_ICN_NIC | RCC_CLOCKTYPE_ICN_VID | RCC_CLOCKTYPE_ICN_APB1 |
                                  RCC_CLOCKTYPE_ICN_APB2 | RCC_CLOCKTYPE_ICN_APB3 | RCC_CLOCKTYPE_ICN_APB4 |
                                  RCC_CLOCKTYPE_ICN_APBDBG | RCC_CLOCKTYPE_RTC;
  uint32_t config;
  /* Get ICN_HS_MCU config */
  UNUSED(pFLatency); /*unused variable*/
  pRCC_ClkInitStruct->ICN_HS_MCU.XBAR_ClkSrc = LL_RCC_GetCrossbarSource(0);
  config = ((RCC->FINDIVxCFGR[0] & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1U);
  pRCC_ClkInitStruct->ICN_HS_MCU.Div = config * ((RCC->PREDIVxCFGR[0] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1U);

  /* Get ICN_LS_MCU config */
  pRCC_ClkInitStruct->ICN_LSMCU_Div = RCC->LSMCUDIVR & 1U;

  /* Get ICN_SDMMC config */
  pRCC_ClkInitStruct->ICN_SDMMC.XBAR_ClkSrc = LL_RCC_GetCrossbarSource(1);
  config = ((RCC->FINDIVxCFGR[1] & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1U);
  pRCC_ClkInitStruct->ICN_SDMMC.Div = config * ((RCC->PREDIVxCFGR[1] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1U);

  /* Get ICN_DDR config */
  pRCC_ClkInitStruct->ICN_DDR.XBAR_ClkSrc = LL_RCC_GetCrossbarSource(2);
  config = ((RCC->FINDIVxCFGR[2] & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1U);
  pRCC_ClkInitStruct->ICN_DDR.Div = config * ((RCC->PREDIVxCFGR[2] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1U);

  /* Get ICN_DISPLAY config */
  pRCC_ClkInitStruct->ICN_DISPLAY.XBAR_ClkSrc = LL_RCC_GetCrossbarSource(3);
  config = ((RCC->FINDIVxCFGR[3] & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1U);
  pRCC_ClkInitStruct->ICN_DISPLAY.Div = config * ((RCC->PREDIVxCFGR[3] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1U);

  /* Get ICN_HCL config */
  pRCC_ClkInitStruct->ICN_HCL.XBAR_ClkSrc = LL_RCC_GetCrossbarSource(4);
  config = ((RCC->FINDIVxCFGR[4] & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1U);
  pRCC_ClkInitStruct->ICN_HCL.Div = config * ((RCC->PREDIVxCFGR[4] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1U);

