zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
  /* Get ICN_NIC config */
  pRCC_ClkInitStruct->ICN_NIC.XBAR_ClkSrc = LL_RCC_GetCrossbarSource(5);
  config = ((RCC->FINDIVxCFGR[5] & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1U);
  pRCC_ClkInitStruct->ICN_NIC.Div = config * ((RCC->PREDIVxCFGR[5] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1U);

  /* Get ICN_VID config */
  pRCC_ClkInitStruct->ICN_VID.XBAR_ClkSrc = LL_RCC_GetCrossbarSource(6);
  config = ((RCC->FINDIVxCFGR[6] & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1U);
  pRCC_ClkInitStruct->ICN_VID.Div = config * ((RCC->PREDIVxCFGR[6] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1U);

  /* Get ICN_APB1 config */
  pRCC_ClkInitStruct->APB1_Div = LL_RCC_GetAPB1Prescaler();

  /* Get ICN_APB2 config */
  pRCC_ClkInitStruct->APB2_Div = LL_RCC_GetAPB2Prescaler();

  /* Get ICN_APB3 config */
  pRCC_ClkInitStruct->APB3_Div = LL_RCC_GetAPB3Prescaler();

  /* Get ICN_APB4 config */
  pRCC_ClkInitStruct->APB4_Div = LL_RCC_GetAPB4Prescaler();

  /* Get ICN_APBDBG config */
  pRCC_ClkInitStruct->APBDBG_Div = LL_RCC_GetAPBDBGPrescaler();

  /* Get RTC settings */
  if (READ_BIT(RCC->BDCR, RCC_BDCR_RTCCKEN) == 0U)
  {
    pRCC_ClkInitStruct->RTCState = RCC_RTC_OFF;
  }
  else
  {
    pRCC_ClkInitStruct->RTCState = RCC_RTC_ON;
  }

  pRCC_ClkInitStruct->RTC_Src = LL_RCC_GetRTCClockSource();

  pRCC_ClkInitStruct->RTC_Div = LL_RCC_GetRTC_HSEPrescaler();
}

/**
  * @brief  Returns the bus clocks frequencies
  *
  * @note   The bus frequencies are recomputed by reading back the settings
  *         in the SoC registers
  * @param  clk  Specifies which output clock frequency should be recomputed.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_CLOCKTYPE_ICN_HS_MCU
  *            @arg @ref RCC_CLOCKTYPE_ICN_LS_MCU
  *            @arg @ref RCC_CLOCKTYPE_ICN_APB1
  *            @arg @ref RCC_CLOCKTYPE_ICN_APB2
  *            @arg @ref RCC_CLOCKTYPE_ICN_APB3
  *            @arg @ref RCC_CLOCKTYPE_ICN_APB4
  *            @arg @ref RCC_CLOCKTYPE_ICN_APBDBG
  *            @arg @ref RCC_CLOCKTYPE_ICN_SDMMC
  *            @arg @ref RCC_CLOCKTYPE_ICN_DDR
  *            @arg @ref RCC_CLOCKTYPE_ICN_DISPLAY
  *            @arg @ref RCC_CLOCKTYPE_ICN_HCL
  *            @arg @ref RCC_CLOCKTYPE_ICN_NIC
  *            @arg @ref RCC_CLOCKTYPE_ICN_VID
  * @retval Bus frequency
  */
uint32_t HAL_RCC_GetFreq(uint32_t clk)
{
  uint32_t freq;
  uint32_t lsmcudiv;
  uint32_t fg_freq;
  uint32_t fgindex;
  uint32_t xbar_source;
  uint32_t xbar_source_freq;
  uint32_t config;
  /* Identify flexgen id based on 'clk' */
  switch (clk)
  {
    case RCC_CLOCKTYPE_ICN_SDMMC:
      fgindex = 1;
      break;
    case RCC_CLOCKTYPE_ICN_DDR:
      fgindex = 2;
      break;
    case RCC_CLOCKTYPE_ICN_DISPLAY:
      fgindex = 3;
      break;
    case RCC_CLOCKTYPE_ICN_HCL:
      fgindex = 4;
      break;
    case RCC_CLOCKTYPE_ICN_NIC:
      fgindex = 5;
      break;
    case RCC_CLOCKTYPE_ICN_VID:
      fgindex = 6;
      break;
    default:
      fgindex = 0;
      break;
  }

  /* Identify xbar source */
  xbar_source = LL_RCC_GetCrossbarSource(fgindex);

  /* Then retrieve the source frequency */
  switch (xbar_source)
  {
    case RCC_XBAR_CLKSRC_PLL4:
      xbar_source_freq = HAL_RCCEx_GetPLL4ClockFreq();
      break;

    case RCC_XBAR_CLKSRC_PLL5:
      xbar_source_freq = HAL_RCCEx_GetPLL5ClockFreq();
      break;

    case RCC_XBAR_CLKSRC_PLL6:
      xbar_source_freq = HAL_RCCEx_GetPLL6ClockFreq();
      break;

    case RCC_XBAR_CLKSRC_PLL7:
      xbar_source_freq = HAL_RCCEx_GetPLL7ClockFreq();
      break;

    case RCC_XBAR_CLKSRC_PLL8:
      xbar_source_freq = HAL_RCCEx_GetPLL8ClockFreq();
      break;

    case RCC_XBAR_CLKSRC_HSI:
      xbar_source_freq = HSI_VALUE;
      break;

    case RCC_XBAR_CLKSRC_HSE:
      xbar_source_freq = HSE_VALUE;
      break;

    case RCC_XBAR_CLKSRC_LSI:
      xbar_source_freq = LSI_VALUE;
      break;

    case RCC_XBAR_CLKSRC_LSE:
      xbar_source_freq = LSE_VALUE;
      break;

    case RCC_XBAR_CLKSRC_MSI:
#if defined(RCC_BDCR_MSIFREQSEL)
      if (READ_BIT(RCC->BDCR, RCC_BDCR_MSIFREQSEL) == 0U)
      {
        xbar_source_freq = RCC_MSI_4MHZ;
      }
      else
#endif /* RCC_BDCR_MSIFREQSEL */
      {
        xbar_source_freq = RCC_MSI_16MHZ;
      }
      break;

    default:
      xbar_source_freq = 0;
      break;
  }
  config = ((RCC->FINDIVxCFGR[fgindex] & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1U);
  fg_freq = xbar_source_freq / (config * ((RCC->PREDIVxCFGR[fgindex] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1U));

  lsmcudiv = ((uint32_t)(RCC->LSMCUDIVR) & RCC_LSMCUDIVR_LSMCUDIV_Msk) + 1U;

  switch (clk)
  {
    case RCC_CLOCKTYPE_ICN_HS_MCU:
    case RCC_CLOCKTYPE_ICN_SDMMC:
    case RCC_CLOCKTYPE_ICN_DDR:
    case RCC_CLOCKTYPE_ICN_DISPLAY:
    case RCC_CLOCKTYPE_ICN_HCL:
    case RCC_CLOCKTYPE_ICN_NIC:
    case RCC_CLOCKTYPE_ICN_VID:
      return fg_freq;
      break;
    case RCC_CLOCKTYPE_ICN_LS_MCU:
      /* return fg freq divided by LSMCU */
      freq = fg_freq / lsmcudiv;
      break;
    case RCC_CLOCKTYPE_ICN_APB1:
      /* return fg freq divided by LSMCU divided by APB1DIV */
      freq = fg_freq / ((uint32_t)(1UL << READ_BIT(RCC->APB1DIVR, RCC_APB1DIVR_APB1DIV)) * lsmcudiv);
      break;
    case RCC_CLOCKTYPE_ICN_APB2:
      /* return fg freq divided by LSMCU divided by APB2DIV */
      freq = fg_freq / ((uint32_t)(1UL << READ_BIT(RCC->APB2DIVR, RCC_APB2DIVR_APB2DIV)) * lsmcudiv);
      break;
    case RCC_CLOCKTYPE_ICN_APB3:
      /* return fg freq divided by LSMCU divided by APB3DIV */
      freq = fg_freq / ((uint32_t)(1UL << READ_BIT(RCC->APB3DIVR, RCC_APB3DIVR_APB3DIV)) * lsmcudiv);
      break;
    case RCC_CLOCKTYPE_ICN_APB4:
      /* return fg freq divided by LSMCU divided by APB4DIV */
      freq = fg_freq / ((uint32_t)(1UL << READ_BIT(RCC->APB4DIVR, RCC_APB4DIVR_APB4DIV)) * lsmcudiv);
      break;
    case RCC_CLOCKTYPE_ICN_APBDBG:
      /* return fg freq divided by LSMCU divided by APBDBGDIV */
      freq = fg_freq / ((uint32_t)(1UL << READ_BIT(RCC->APBDBGDIVR, RCC_APBDBGDIVR_APBDBGDIV)) * lsmcudiv);
      break;
    default: /* Unknown clock */
      freq = 0xFFFFFFFFU;
      break;
  }

  return freq;
}

/**
  * @brief  Return the clock source of a peripheral
  * @param  clk_id  The parameter can be one of the following values:
  *            @arg @ref RCC_PERIPHCLK_LPTIM1_2
  *            @arg @ref RCC_PERIPHCLK_UART2_4
  *            @arg @ref RCC_PERIPHCLK_UART3_5
  *            @arg @ref RCC_PERIPHCLK_SPI2_3
  *            @arg @ref RCC_PERIPHCLK_SPDIFRX
  *            @arg @ref RCC_PERIPHCLK_I2C1_2
  *            @arg @ref RCC_PERIPHCLK_I3C1_2
  *            @arg @ref RCC_PERIPHCLK_I2C3_5
  *            @arg @ref RCC_PERIPHCLK_I3C3
  *            @arg @ref RCC_PERIPHCLK_I2C4_6
  *            @arg @ref RCC_PERIPHCLK_I2C7
  *            @arg @ref RCC_PERIPHCLK_SPI1
  *            @arg @ref RCC_PERIPHCLK_SPI4_5
  *            @arg @ref RCC_PERIPHCLK_SPI6_7
  *            @arg @ref RCC_PERIPHCLK_USART1
  *            @arg @ref RCC_PERIPHCLK_USART6
  *            @arg @ref RCC_PERIPHCLK_UART7_8
  *            @arg @ref RCC_PERIPHCLK_UART9
  *            @arg @ref RCC_PERIPHCLK_SAI1_MDF1
  *            @arg @ref RCC_PERIPHCLK_SAI2
  *            @arg @ref RCC_PERIPHCLK_SAI3_4
  *            @arg @ref RCC_PERIPHCLK_FDCAN
  *            @arg @ref RCC_PERIPHCLK_LTDC
  *            @arg @ref RCC_PERIPHCLK_DSIPHY
  *            @arg @ref RCC_PERIPHCLK_DCMIPP
  *            @arg @ref RCC_PERIPHCLK_CSITXESC
  *            @arg @ref RCC_PERIPHCLK_CSIPHY
  *            @arg @ref RCC_PERIPHCLK_LVDSPHY
  *            @arg @ref RCC_PERIPHCLK_STGEN
  *            @arg @ref RCC_PERIPHCLK_USB3PCIEPHY
  *            @arg @ref RCC_PERIPHCLK_USBTC
  *            @arg @ref RCC_PERIPHCLK_I3C4
  *            @arg @ref RCC_PERIPHCLK_SPI8
  *            @arg @ref RCC_PERIPHCLK_I2C8
  *            @arg @ref RCC_PERIPHCLK_LPUART1
  *            @arg @ref RCC_PERIPHCLK_LPTIM3
  *            @arg @ref RCC_PERIPHCLK_LPTIM4_5
  *            @arg @ref RCC_PERIPHCLK_ADF1
  *            @arg @ref RCC_PERIPHCLK_TSDBG
  *            @arg @ref RCC_PERIPHCLK_TPIU
  *            @arg @ref RCC_PERIPHCLK_ATB
  *            @arg @ref RCC_PERIPHCLK_ADC12
  *            @arg @ref RCC_PERIPHCLK_ADC3
  *            @arg @ref RCC_PERIPHCLK_OSPI1
  *            @arg @ref RCC_PERIPHCLK_OSPI2
  *            @arg @ref RCC_PERIPHCLK_FMC
  *            @arg @ref RCC_PERIPHCLK_SDMMC1
  *            @arg @ref RCC_PERIPHCLK_SDMMC2
  *            @arg @ref RCC_PERIPHCLK_SDMMC3
  *            @arg @ref RCC_PERIPHCLK_ETH1_ETHSW
  *            @arg @ref RCC_PERIPHCLK_ETH2
  *            @arg @ref RCC_PERIPHCLK_ETH1PTP_ETH2PTP
  *            @arg @ref RCC_PERIPHCLK_USB2PHY1
  *            @arg @ref RCC_PERIPHCLK_USB2PHY2
  *            @arg @ref RCC_PERIPHCLK_ICN_M_GPU
  *            @arg @ref RCC_PERIPHCLK_ETHSWREF
  *            @arg @ref RCC_PERIPHCLK_MCO1
  *            @arg @ref RCC_PERIPHCLK_MCO2
  *            @arg @ref RCC_PERIPHCLK_CPU1_EXT2F
  * @retval clock source
  */
uint32_t HAL_RCC_GetSource(uint32_t clk_id)
{
  uint32_t source;
  RCC_PeriphCLKInitTypeDef PeriphCLKConfig = {0};

  PeriphCLKConfig.XBAR_Channel = clk_id;

  HAL_RCCEx_GetPeriphCLKConfig(&PeriphCLKConfig);

  source = PeriphCLKConfig.XBAR_ClkSrc;

  return source;
}

/**
  * @brief  Return the CM33 frequency.
  * @retval CM33 frequency in Hz
  */
uint32_t HAL_RCC_GetCM33Freq(void)
{
  return HAL_RCC_GetFreq(RCC_CLOCKTYPE_ICN_HS_MCU);
}

/**
  * @brief Handle the RCC global interrupt request.
  * @retval None
  */
void HAL_RCC_IRQHandler(void)
{
  uint32_t Flags = 0;

  __HAL_RCC_CLEAR_IT(0xFFFFFFFFU);

  /* RCC interrupt user callback */
  HAL_RCC_Callback(Flags);
}

/**
  * @brief  RCC global interrupt callback
  * @param  Flags: It contains the flags which were set during the RCC_IRQHandler
  *                before cleaning them
  * @retval None
  */
__weak void HAL_RCC_Callback(uint32_t Flags)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_RCC_Callback could be implemented in the user file
  */
  UNUSED(Flags); /* unused variable */
}

/**
  * @brief Handle the RCC wakeup interrupt request.
  * @retval None
  */
void HAL_RCC_WAKEUP_IRQHandler(void)
{
  uint32_t Flags = 0;

