zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
  /* RCC wakeup interrupt user callback */
  HAL_RCC_WAKEUP_Callback(Flags);
}

/**
  * @brief  RCC wakeup interrupt callback
  * @param  Flags: It contains the flags which were set during the RCC_WAKEUP_IRQHandler
  *                before cleaning them
  * @retval None
  */
__weak void HAL_RCC_WAKEUP_Callback(uint32_t Flags)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_RCC_WAKEUP_Callback could be implemented in the user file
  */
  UNUSED(Flags); /* unused variable */
}

/**
  * @brief Handle the RCC HSIMON interrupt request.
  * @retval None
  */
void HAL_RCC_HSIMON_IRQHandler(void)
{
  uint32_t Flags = 0;

  /* RCC HSIMON interrupt user callback */
  HAL_RCC_HSIMON_Callback(Flags);
}

/**
  * @brief  RCC HSIMON interrupt callback
  * @param  Flags: It contains the flags which were set during the RCC_HSIMON_IRQHandler
  *                before cleaning them
  * @retval None
  */
__weak void HAL_RCC_HSIMON_Callback(uint32_t Flags)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_RCC_HSIMON_Callback could be implemented in the user file
  */
  UNUSED(Flags); /* unused variable */
}

/**
  * @brief  RCC Clock Security System interrupt callback.
  * @retval none
  */
__weak void HAL_RCC_CSSCallback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_RCC_CSSCallback should be implemented in the user file
   */
}

/* Read a register in same device to be sure that previous write operation */
/* into RCC_RxSEMCR is completed (without breaking processor pipeline).    */
__STATIC_INLINE HAL_StatusTypeDef WAIT_MUTEX_WRITTEN_IN_RCC_RxSEMCR(uint32_t LocalResIndex)
{
  /* Therefore, we take this opportunity to check (by reading register RCC_RxCIDCFGR[i]) */
  /* that a dynamic CID filtering is effectively configured for present local resource. */
  if ((READ_REG(RCC->R[LocalResIndex].CIDCFGR) & RCC_LOCALRES_ATTR_CID_TYPE_MSK) == RCC_LOCALRES_CID_TYPE_DYNAMIC)
  {
    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }
}

/**
  * @}
  */
/** @defgroup RCC_Exported_Functions_Group3 Attributes management functions
  *  @brief Attributes management functions.
  *
@verbatim
 ===============================================================================
                       ##### RCC attributes functions #####
 ===============================================================================
@endverbatim
  * @{
  */

/** @defgroup RCC_HAL_RIF_Exported_Functions RCC HAL RIF Exported Functions
  * @{
  */

/** @defgroup RCC_HAL_EF_RIF RCC HAL RIF
  * @brief RCC HAL RIF module driver
  * @{
  */

/* On secure Cortex core only : */
#if defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  Configure Security/Privilege/CID Access Filtering of one RCC Local Resource
  *         Lock this configuration if requested
  * @param  LocalResIndex Value can be 0 - 113 and ref can be found in RCC_LL_EC_RIF_LOCALRES
  * @param  LocalResAttributes Value set by an "OR" operation between :
  *         - one or none Lock configuration argument
  *           @arg RCC_LOCALRES_LOCKED
  *         - one or none Security filtering argument
  *           @arg RCC_LOCALRES_SEC
  *           @arg RCC_LOCALRES_NOSEC
  *         - one or none Privilege filtering argument
  *           @arg RCC_LOCALRES_PRIV
  *           @arg RCC_LOCALRES_NOPRIV
  *         - none or one Static CID filtering argument among
  *           @arg RCC_LOCALRES_CID_STATIC_0
  *           @arg RCC_LOCALRES_CID_STATIC_1
  *           @arg RCC_LOCALRES_CID_STATIC_2
  *           @arg RCC_LOCALRES_CID_STATIC_3
  *           @arg RCC_LOCALRES_CID_STATIC_4
  *           @arg RCC_LOCALRES_CID_STATIC_5
  *           @arg RCC_LOCALRES_CID_STATIC_6
  *           @arg RCC_LOCALRES_CID_STATIC_7
  *           or else a constant Dynamic CID filtering argument among
  *           @arg RCC_LOCALRES_CID_DYNAMIC_NONE
  *           @arg RCC_LOCALRES_CID_DYNAMIC_ALL
  *           or else an "OR" combination of Dynamic CID filtering arguments among
  *           @arg RCC_LOCALRES_CID_DYNAMIC_0
  *           @arg RCC_LOCALRES_CID_DYNAMIC_1
  *           @arg RCC_LOCALRES_CID_DYNAMIC_2
  *           @arg RCC_LOCALRES_CID_DYNAMIC_3
  *           @arg RCC_LOCALRES_CID_DYNAMIC_4
  *           @arg RCC_LOCALRES_CID_DYNAMIC_5
  *           @arg RCC_LOCALRES_CID_DYNAMIC_6
  *           @arg RCC_LOCALRES_CID_DYNAMIC_7
  *
  * @note If Lock configuration argument is not provided,
  *       Security/Privilege/CID filtering configuration is not locked.
  *       If Security filtering configuration argument is not provided,
  *       no security filtering configuration is applied.
  *       If Privilege filtering configuration argument is not provided,
  *       no privilege filtering configuration is applied.
  *       If neither static CID filtering argument,
  *       nor dynamic CID filtering argument is provided,
  *       CID filtering is disabled.
  * @retval HAL Status in {HAL_OK; HAL_ERROR}.
  */
HAL_StatusTypeDef HAL_RCC_ConfigAttributes(uint32_t LocalResIndex, uint32_t LocalResAttributes)
{
  /* Initialize HAL status */
  HAL_StatusTypeDef hal_status = HAL_BUSY;

  /* Split LOCK/PRIV/SEC/CID attributes */
  uint32_t priv_attr = LocalResAttributes & RCC_LOCALRES_ATTR_PRIV_MSK;
  uint32_t lock_attr = LocalResAttributes & RCC_LOCALRES_ATTR_LOCK_MSK;
  uint32_t sec_attr  = LocalResAttributes & RCC_LOCALRES_ATTR_SEC_MSK;
  uint32_t cid_attr  = LocalResAttributes & (RCC_LOCALRES_ATTR_CID_TYPE_MSK |
                                             RCC_LOCALRES_ATTR_STATIC_CID_MSK |
                                             RCC_LOCALRES_ATTR_DYNAMIC_CID_MSK);

  /* Check input parameters : */
  /* - valid range of LocalResIndex */
  assert_param(IS_LOCALRES_INDEX(LocalResIndex));
  /* - valid value of PRIV attribute */
  assert_param(IS_PRIV_ATTRIBUTE(priv_attr));
  /* - valid value of LOCK attribute */
  assert_param(IS_LOCK_ATTRIBUTE(lock_attr));
  /* - valid value of SEC attribute */
  assert_param(IS_SEC_ATTRIBUTE(sec_attr));
  /* - valid values of CID type, Static CID and Dynamic CID attributes */
  assert_param(IS_CID_ATTRIBUTE(cid_attr));

  /* Take into account that TDCID is allowed to set any configuration */
  /* that is to say modifying security and privilege filtering */
  /* even if current CID filtering prevents to do it. */
#if defined(CORE_CA35)
  LL_RCC_SetLocalResSCid(LocalResIndex, RCC_LOCALRES_CID_STATIC_1);
#endif /* CORE_CA35 */
#if defined(CORE_CM33)
  LL_RCC_SetLocalResSCid(LocalResIndex, RCC_LOCALRES_CID_STATIC_2);
#endif /* CORE_CM33 */

