zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc.c
  /* Manage PRIV filtering attribute */
  if (priv_attr == RCC_LOCALRES_PRIV)
  {
    LL_RCC_EnableLocalResPrivilege(LocalResIndex);
  }
  else if (priv_attr == RCC_LOCALRES_NOPRIV)
  {
    LL_RCC_DisableLocalResPrivilege(LocalResIndex);
  }

  /* Manage SEC filtering attribute */
  if (sec_attr == RCC_LOCALRES_SEC)
  {
    LL_RCC_EnableLocalResSecure(LocalResIndex);
  }
  else if (sec_attr == RCC_LOCALRES_NOSEC)
  {
    LL_RCC_DisableLocalResSecure(LocalResIndex);
  }
  /* Manage CID filtering attributes */
  switch (cid_attr & RCC_LOCALRES_ATTR_CID_TYPE_MSK)
  {
    case RCC_LOCALRES_CID_TYPE_STATIC:
      LL_RCC_SetLocalResSCid(LocalResIndex, cid_attr);
      break;
    case RCC_LOCALRES_CID_TYPE_DYNAMIC:
      LL_RCC_SetLocalResWLCid(LocalResIndex, cid_attr);
      break;
    case RCC_LOCALRES_CID_TYPE_NONE:
      LL_RCC_SetLocalResNoCid(LocalResIndex);
      break;
    default :
      hal_status = HAL_ERROR;
      break;
  }
  /* Manage LOCK configuration attribute */
  if (lock_attr == RCC_LOCALRES_LOCKED)
  {
    LL_RCC_LockLocalResConfig(LocalResIndex);
  }

  /* return HAL status */
  if (hal_status == HAL_BUSY)
  {
    hal_status = HAL_OK;
  }
  return hal_status;
}
#endif /* defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  Get Security/Privilege/CID Access Filtering configuration of one RCC Local Resource
  * @param  LocalResIndex Value can be 0 - 113 and ref can be found in RCC_LL_EC_RIF_LOCALRES
  * @param  pLocalResAttributes Returned value composed of following bitfield :
  *         . bits [31:24] Locked configuration state
  *         . bits [23:16] CID whitelist (dynamic CIDs list)
  *         . bits [15:12] Security filtering state
  *         . bits [11:8]  Privilege filtering state
  *         . bit  7       Reserved
  *         . bits [6:4]   Static CID
  *         . bits [3:2]   Reserved
  *         . bits [1:0]   CID filtering type
  *         to be compared with following reference values
  *         - linked to Lock configuration state
  *           @arg RCC_LOCALRES_LOCKED
  *         - linked to Security filtering state
  *           @arg RCC_LOCALRES_SEC
  *           @arg RCC_LOCALRES_NOSEC
  *         - linked to Privilege filtering state
  *           @arg RCC_LOCALRES_PRIV
  *           @arg RCC_LOCALRES_NOPRIV
  *         - linked to Static CID filtering configuration
  *           @arg RCC_LOCALRES_CID_STATIC_0
  *           @arg RCC_LOCALRES_CID_STATIC_1
  *           @arg RCC_LOCALRES_CID_STATIC_2
  *           @arg RCC_LOCALRES_CID_STATIC_3
  *           @arg RCC_LOCALRES_CID_STATIC_4
  *           @arg RCC_LOCALRES_CID_STATIC_5
  *           @arg RCC_LOCALRES_CID_STATIC_6
  *           @arg RCC_LOCALRES_CID_STATIC_7
  *         - linked to Dynamic CID filtering configuration
  *           @arg RCC_LOCALRES_CID_DYNAMIC_NONE
  *           @arg RCC_LOCALRES_CID_DYNAMIC_ALL
  *           @arg RCC_LOCALRES_CID_DYNAMIC_0
  *           @arg RCC_LOCALRES_CID_DYNAMIC_1
  *           @arg RCC_LOCALRES_CID_DYNAMIC_2
  *           @arg RCC_LOCALRES_CID_DYNAMIC_3
  *           @arg RCC_LOCALRES_CID_DYNAMIC_4
  *           @arg RCC_LOCALRES_CID_DYNAMIC_5
  *           @arg RCC_LOCALRES_CID_DYNAMIC_6
  *           @arg RCC_LOCALRES_CID_DYNAMIC_7
  * @retval HAL Status in {HAL_OK; HAL_ERROR}.
  */
HAL_StatusTypeDef HAL_RCC_GetConfigAttributes(uint32_t LocalResIndex, uint32_t *pLocalResAttributes)
{
  uint32_t local_res_attr;

  /* Initialize HAL status */
  HAL_StatusTypeDef hal_status = HAL_BUSY;

  /* Check input parameters : */
  /* - not-null pointer for pLocalResAttributes */
  if (pLocalResAttributes == NULL)
  {
    return HAL_ERROR;
  }
  /* - valid range of LocalResIndex */
  assert_param(IS_LOCALRES_INDEX(LocalResIndex));

  /* Initialize attributes value to None */
  local_res_attr = RCC_LOCALRES_ATTR_NONE;
  /* and LocalResAttributes value to Invalid */
  *pLocalResAttributes = RCC_LOCALRES_ATTR_INVALID;

  /* Get local resource lock state */
  if (LL_RCC_IsLockedLocalResConfig(LocalResIndex) == 1U)
  {
    /* to set lock configuration attribute accordingly */
    local_res_attr |= RCC_LOCALRES_LOCKED;
  }

  /* Get local resource security filtering state */
  if (LL_RCC_IsEnabledLocalResSecure(LocalResIndex) == 1U)
  {
    /* to set security filtering attribute accordingly */
    local_res_attr |= RCC_LOCALRES_SEC;
  }
  else
  {
    local_res_attr |= RCC_LOCALRES_NOSEC;
  }

  /* Get local resource privilege filtering state */
  if (LL_RCC_IsEnabledLocalResPrivilege(LocalResIndex) == 1U)
  {
    /* to set privilege filtering attribute accordingly */
    local_res_attr |= RCC_LOCALRES_PRIV;
  }
  else
  {
    local_res_attr |= RCC_LOCALRES_NOPRIV;
  }

  /* Get local resource CID filtering settings */
  /* to set None/Static/Dynamic CID filtering attributes accordingly */
  local_res_attr |= LL_RCC_GetLocalResCid(LocalResIndex);

  /* Output LocalResAttributes value */
  *pLocalResAttributes = local_res_attr;

  /* return HAL status */
  if (hal_status == HAL_BUSY)
  {
    hal_status = HAL_OK;
  }
  return hal_status;
}

/**
  * @brief  Take semaphore to access RCC Local Resource.
  *         Check semaphore has been effectively taken.
  * @param  LocalResIndex Value can be 0 - 113 and ref can be found in RCC_LL_EC_RIF_LOCALRES
  * @note   If operation fails, return error status.
  * @retval HAL Status in {HAL_OK; HAL_ERROR}.
  */
HAL_StatusTypeDef HAL_RCC_TakeLocalResSemaphore(uint32_t LocalResIndex)
{
  /* Initialize HAL status */
  HAL_StatusTypeDef hal_status = HAL_BUSY;

  /* Check input parameter : LocalResIndex in valid range */
  assert_param(IS_LOCALRES_INDEX(LocalResIndex));

  /* For local resource : */
  /* - check semaphore initial state */
  /*   and set output status accordingly */
  if ((LL_RCC_GetLocalResSem(LocalResIndex) & RCC_RxSEMCR_SEM_MUTEX) == RCC_RxSEMCR_SEM_MUTEX)
  {
    /*   <=> if already taken, then output error status */
    return HAL_ERROR;
  }
  /* - take semaphore */
  LL_RCC_TakeLocalResSem(LocalResIndex);
  /* - once mutex has been updated in target register, */
  (void)WAIT_MUTEX_WRITTEN_IN_RCC_RxSEMCR(LocalResIndex);
  /*   check semaphore has been taken */
  /*   and set output status accordingly */
  /*   <=> if semaphore has not been taken by : */
  /*       - CID1 in A35 case, */
#if defined(CORE_CA35)
  if (LL_RCC_GetLocalResSem(LocalResIndex) != RCC_LOCALRES_TAKEN_SEMCID1)
#endif /* CORE_CA35 */
    /*       - CID2 in M33 case, */
#if defined(CORE_CM33)
    if (LL_RCC_GetLocalResSem(LocalResIndex) != RCC_LOCALRES_TAKEN_SEMCID2)
#endif /* CORE_CM33 */
    {
      /*       then output error status */
      return HAL_ERROR;
    }
  /* return HAL status */
  if (hal_status == HAL_BUSY)
  {
    hal_status = HAL_OK;
  }
  return hal_status;
}

/**
  * @brief  Release semaphore used to access RCC Local Resource.
  *         Check semaphore has been effectively released.
  * @param  LocalResIndex Value can be 0 - 113 and ref can be found in RCC_LL_EC_RIF_LOCALRES
  * @note   If operation fails, return error status.
  * @retval HAL Status in {HAL_OK; HAL_ERROR}.
  */
HAL_StatusTypeDef HAL_RCC_ReleaseLocalResSemaphore(uint32_t LocalResIndex)
{
  /* Initialize HAL status */
  HAL_StatusTypeDef hal_status = HAL_BUSY;

